{
  "blogs": [
    {
      "id": "0125",
      "title": "Man must explore, and this is exploration at its greatest",
      "authorName": "Ranit",
      "subTitle": "Problems look mighty small from 150 miles up",
      "blogDesc": "Never in all their history have men been able truly to conceive of the world as one: a single sphere, a globe, having the qualities of a globe, a round earth in which all the directions eventually meet, in which there is no center because every point, or none, is center — an equal earth which all men occupy as equals. The airman's earth, if free men make it, will be truly round: a globe in practice, not in theory.\n\nScience cuts two ways, of course; its products can be used for both good and evil. But there's no turning back from science. The early warnings about technological dangers also come from science.\n\nWhat was most significant about the lunar voyage was not that man set foot on the Moon but that they set eye on the earth.\n\nA Chinese tale tells of some men sent to harm a young girl who, upon seeing her beauty, become her protectors rather than her violators. That's how I felt seeing the Earth for the first time. I could not help but love and cherish her.\n\nFor those who have seen the Earth from space, and for the hundreds and perhaps thousands more who will, the experience most certainly changes your perspective. The things that we share in our world are far more valuable than those which divide us.\n\nThe Final Frontier\nThere can be no thought of finishing for ‘aiming for the stars.’ Both figuratively and literally, it is a task to occupy the generations. And no matter how much progress one makes, there is always the thrill of just beginning.\n\nThere can be no thought of finishing for ‘aiming for the stars.’ Both figuratively and literally, it is a task to occupy the generations. And no matter how much progress one makes, there is always the thrill of just beginning.\n\nThe dreams of yesterday are the hopes of today and the reality of tomorrow. Science has not yet mastered prophecy. We predict too much for the next year and yet far too little for the next ten.\nSpaceflights cannot be stopped. This is not the work of any one man or even a group of men. It is a historical process which mankind is carrying out in accordance with the natural laws of human development.\n\nReaching for the Stars\nAs we got further and further away, it [the Earth] diminished in size. Finally it shrank to the size of a marble, the most beautiful you can imagine. That beautiful, warm, living object looked so fragile, so delicate, that if you touched it with a finger it would crumble and fall apart. Seeing this has to change a man.Space, the final frontier. These are the voyages of the Starship Enterprise. Its five-year mission: to explore strange new worlds, to seek out new life and new civilizations, to boldly go where no man has gone before.\n\nAs I stand out here in the wonders of the unknown at Hadley, I sort of realize there’s a fundamental truth to our nature, Man must explore, and this is exploration at its greatest.",
      "photo": "nasa.jpg",
      "date": "2024-03-23",
      "time": "22:54:51"
    },
    {
      "id": "90e6",
      "title": "Is Social Media Making the Same Mistake as The Church?",
      "authorName": "Cherry",
      "subTitle": "Over the last few years, the American Church has been hemorrhaging people. With the advent of the internet and other cultural shifts, churches began seeing their main competition as the entertainment industry",
      "blogDesc": "Over the last few years, the American Church has been hemorrhaging people. With the advent of the internet and other cultural shifts, churches began seeing their main competition as the entertainment industry. Because their primary contact with the public was during the weekend service, many leaders lamented the rise in families' choices when deciding what to do during their precious days off. It's understandable at a glance. A priority of the generations before was being eroded before leaders' eyes. But if we look deeper, we can see the fatal flaw that created the modern exodus was instilled by the Protestant Reformation and exacerbated by the Church Growth Movement. Believe it or not, the Church's story looks eerily similar to the trajectory of social media platforms. Is Social Media making the same mistake as the Church? What was the Church's error?\n\nA Focus on Content.\nDon't get me wrong, content is an essential component in any church and, for that matter, social platform. Still, the over-reliance and hyper-focus on content caused a subversive flaw that caused many churches to struggle. The Reformation created a needed counterbalance to the unchecked doctrine of the Church 500 years ago. Luther spoke about the oppressive practices that church leadership inflicted on the commoner. He created needed reform and, in the process, called people back to Jesus as the only mediator between God and Man. Additionally, He led a movement to make preaching and hearing of the Word of God the central act of gathering the Church. Leaders moved the Pulpit to the center of the platform as a sign of their commitment to Scripture Alone.\n\nThe move was a heartfelt gesture, but it had some unintended consequences. The Church began to rely on the orator's gift of communication as the primary function of the Church. Whereas Church architecture was first designed to create a transcendent emotion, influencing the commoner to revere the Holiness of God, the architecture began to shift toward a more acoustically-friendly structure to magnify the preacher's voice. The church was first built in town to remind people to put Jesus at the center of their life. Gatherings at the building silently slowly began transitioning towards the centrality of the teacher's voice in their life.\n\nAs culture shifted and eras passed, the Oratory gifts became more pronounced as the primary driver for Churches to grow. With the American decoupling of the fiduciary responsibility of the State to fund the Church, local congregations were now dealt with the unenviable task of supporting their religious institutions. The separation of Church and State created a poverty-stricken environment for most church leaders and faith communities. Fortunately, most townspeople felt the value a church provided to their societies. The technological advances of the 19th and 20th centuries allowed many people to begin hearing and following the Best Preachers in the World. And Entrepreneurial spirit arose in some of the best preachers of the age as they showed prowess for growing organizations and funding around their preaching gifts.\n\nThen came the radio, TV, and Tent Revivals of the 1950s and the stadium tours of the best Preachers in America. Then One pastor saw the broadcasting power of the TV as a means to reach the World with the Message of Jesus. Robert Schuller would soon discover that it had the unintended consequence of growing his Church, which made his organization and him rich. A decade later Hippies began creating a culturally relevant vibe of music that slowly and brutally took over the hymnody of yesteryear. Churches that quickly transitioned to or started with this approach of a dynamic speaker, contemporary music, and a savvy communications staff exploded in growth and bank account.\n\nThis era created the lineage of churches recreating the competitive advantage of these early adopters. Until almost every Church looked the same, most people were suffering as much as they were before they came to these hip churches, and the bank accounts of the churches were running dry as they tried to keep up with the Hybels of the church world.",
      "photo": "about.jpg",
      "date": "2024-03-24",
      "time": "11:01:48"
    },
    {
      "id": "22aa",
      "title": "Join NewBreed at Exponential Orlando",
      "authorName": "Orlando",
      "subTitle": "Exponential Orlando is the largest annual gathering of church planters in the world, and NewBreed is excited to be leading a pre-conference session, workshop track, networking lunch, as well as sponsoring.",
      "blogDesc": "Exponential Orlando is the largest annual gathering of church planters in the world, and NewBreed is excited to be leading a pre-conference session, workshop track, networking lunch, as well as sponsoring. With such extensive involvement, we are looking forward to changing the conversation around church planting. Rather than merely starting worship services, we need to plant first-century style churches by engaging the lost with the gospel, making disciples, and reaping a church plant as a harvest.\n\nIf you are attending the conference, we would love for you to join us at one of our sessions, or stop by our booth in the main worship center. Below is what our team is leading during the conference:\n\nChurch Planting Nuts & Bolts Pre-Conference\nChurch planting isn’t just a list of tasks, it’s a holy undertaking that is based on biblical principles. Where most church planters go wrong is by trying to check off action items from a cookie cutter launch sequence. But God’s a little bit like lightning, he doesn’t strike the same way twice. The Apostle Paul followed a repeated pattern of planting, but the order of his sequence changed from place to place. On day one of this pre-conference, we’ll teach you Paul’s pattern and how to adapt it to your context. Then, on day two, we’ll discuss the paradigm shift needed to move from merely starting a church service to planting a church. You’ll learn how to actually do the things that Jesus trained the twelve for during his ministry.\n\nSpeakers: Peyton Jones, Andrea Jones, Steve Erikson\nDay / Time: Monday 1:00pm – 5:00pm and Tuesday 8:00am – 11:30am\nLocation: Faith Hall - Room 301H\n\nWorkshop Session 1: Assembling and Training a Church Planting Team\nChurch planting is too difficult to do it alone. You need a team! But…how do you assemble one? And then, how do you train your team and prepare them for church planting? Join us for a workshop where we’ll teach you how to identify, invite, and incorporate team members into your church plant, and do it in a way that doesn’t just use them, but actually embeds them into the core of your ministry.\nLocation: Faith Hall - Room 301H\nSpeakers: Peyton Jones, Andrea Jones, Beau Moffatt\n\nWorkshop Session 2: Crafting Your Church Plant's Gathering\nMost church planters are counting down the days to a public launch, wanting everything to go perfectly, but what exactly are your church gatherings supposed to look like? Usually it’s just copy and pasted from another church. In this workshop though, we’ll walk you through how to craft a gathering that intentionally considers the different aspects of Jesus’ ministry. A sermon and worship music is great, but this is your opportunity to start fresh!\nLocation: Faith Hall - Room 301H\nSpeakers: Peyton Jones\n\nArt and Science of Planting Churches Lunch\nIn this session, Peyton Jones, Pat Linnell, and Mike Chong Perkinson will lay out a church planting pathway that begins in discipleship, moves into church planting, and finishes with becoming a reproducing church planting hub. The Plantology Pathway is based on biblical principles, that are equal parts timeless science and creative art, which will help you disciple like Jesus to Plant like Paul.\n\nLunch will be provided; RSVP at the link below.\nRSVP: NewBreed Training Lunch Tickets\nDay/Time: Wednesday, March 8 / 12:30pm – 2:00pm\nLocation: Faith Hall - Room 301H\n\nWorkshop Session 3: Identifying Your Church Plant’s Place in the Community\nUnless you’re planting among an unreached people group, then there are already churches in your community trying to seek and save the lost. So, the question is, where does your church plant fit? In this workshop, we’ll help you assess three areas: your burdens, resources, and divine opportunities. Where those three intersect is where you should focus your church planting efforts and where you’ll be most effective.\nLocation: Faith Hall - Room 301H\nSpeakers: Peyton Jones, Michael Carrion\n\nWorkshop Session 4: Leveraging AI for Church Planting\nChurch planters often get bogged down in the details: filing legal documents, researching, scheduling meetings, following up with guests, and tracking finances. Now, many mundane tasks can be abbreviated through the use of artificial intelligence. These tools can draft our writing, summarize the writing of others, and more. But the big question is…how much is too much? Should I use AI to write sermon outlines? Or draft a doctrine statement? Join us to learn some shortcuts for planting a church and also for guiding principles to know where to give something your personal touch.\nLocation: Faith Hall - Room 301H\nSpeakers: Chestly Lunday, Beau Moffatt\n\nWorkshop Session 4: The Guts and Glory of Ministry Marriages\nMarriage and ministry can go together like peanut butter and jelly...OR like oil and water. God's plan is not for you to just \"stay together\" but to \"flourish together\" in what we call a Level 5 marriage. Your \"marriage habits\" will be the deciding factor. In this fun and informative workshop, two veteran ministry couples will share several of our most helpful lessons which have been essential to the marriages we now enjoy.\nLocation: Worship Center - Room 118\nSpeakers: Deb Walkemeyer, Larry Walkemeyer, Andrea Jones, Peyton Jones",
      "photo": "",
      "date": "2024-03-26",
      "time": "11:06:14"
    }
  ]
}